Autodesk.Revit.DB.DirectShapeType.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ElementId)
Creates a DirectShapeType element.
document:
The document that will contain the new element.
name:
Name of the DirectShapeType.
categoryId:
Id of the category assigned to this DirectShapeType. Must be a valid category id.
Returns:
The new DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Document document may not contain DirectShape or DirectShapeType objects.
-or-
Element id categoryId may not be used as a DirectShape category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015